Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Demonstrates how to automate FTP uploading using the operating system's built-in FTP command.
ja: オペレーティングシステム内蔵のFTPコマンドを使用して、FTPアップロードを自動化する方法について説明します。

source: Demonstrates how to check a file for a specific attribute.
ja: 特定の属性のファイルをチェックする方法を説明します。

source: Demonstrates how to check a folder for a specific attribute.
ja: 特定の属性についてフォルダをチェックする方法を説明します。

source: Demonstrates how to manipulate the OK button of an input box while the script is waiting for user input.
ja: スクリプトがユーザーの入力を待っている間に、入力ボックスのOKボタンを操作する方法を説明します。

source: Demonstrates how to sleep for less time than the normal 10 or 15.6 milliseconds.
ja: 通常の10ミリ秒や15.6ミリ秒よりも短い時間でスリープする方法を示します。

source: Demonstrates how to subclass a GUI window by redirecting its WindowProc to a new WindowProc in the script.
ja: GUIウィンドウのWindowProcをスクリプト内の新しいWindowProcにリダイレクトして、サブクラス化する方法を示すものです。

source: Demonstrates nesting Try-Catch statements.
ja: Try-Catchステートメントの入れ子を示す。

source: Demonstrates some of the various menu object members.
ja: 様々なメニューオブジェクトメンバーの一部を実演しています。

source: Demonstrates some techniques for wrapping COM interfaces.
ja: COMインタフェースをラッピングするいくつかのテクニックを実証します。

source: Demonstrates the basic concept of Try-Catch and Throw.
ja: Try-Catchと Throwの基本概念を示します。

source: Demonstrates the behavior of Finally in detail.
ja: finallyの挙動を詳細に示します。

source: Demonstrates the behavior of finally in detail.
ja: finallyの挙動を詳細に示します。

source: Demonstrates the difference between a case insensitive and case sensitive search.
ja: 大文字小文字を区別しない検索と大文字小文字を区別する検索の違いを説明する。

source: Demonstrates the difference between a case-insensitive and case-sensitive comparison.
ja: 大文字小文字を区別しない比較と区別する比較の違いを示す。

source: Demonstrates the difference between a case-insensitive and case-sensitive search.
ja: 大文字小文字を区別したり、しなかったりしたときの例です。

source: Demonstrates the effects of WinSetTransparent and WinSetTransColor.
ja: WinSetTransparentとWinSetTransColorの効果を示す。

source: Demonstrates the usage of the Match object.
ja: Matchオブジェクトの使い方を説明します。

source: Demonstrates the usage of the standard input/output streams.
ja: 標準入出力ストリームの使い方を説明します。

source: Demonstrates the use of Try-Catch dealing with COM errors.
ja: COMエラーを処理するTry-Catchの使用法を示す。

source: Depending on OS version, this style might require Internet Explorer 5.0 or greater.
ja: OSのバージョンによっては、Internet Explorer 5.0以上が必要です。

source: Depending on OS version, this style might require Internet Explorer 5.01 or greater.
ja: OSのバージョンによっては、Internet Explorer 5.01以上が必要です。

source: Depending on the control type, CurrentType is one of the following strings:
ja: コントロールの種類により、CurrentTypeは以下の文字列のいずれかとなります：

source: Depending on the control type, RetrievedType is one of the following strings:
ja: コントロールの種類により、RetrievedTypeは以下の文字列のいずれかとなります：

source: Depending on the condition, control flows one of two ways:
ja: 条件によって、制御は2通りの流れになります。

source: Depending on the condition, control flows one of two ways: #1 (if true) → #1.1 → #1.2 → #3; or #1 (if false) → #2 (else) → #2.1 → #3.
ja: 条件によって、制御は2通りの流れになります：#1 (if true) → #1.1 → #1.2 → #3、または #1 (if false) → #2 (else) → #2.1 → #3。

source: Depending on the content of the items being sorted, the performance will be 1 to 8 times worse than the default method of insensitivity.
ja: ソートされる項目の内容にもよるが、デフォルトの不感症の方法よりも1倍から8倍パフォーマンスが悪くなります。

source: Depending on the nature of the control, the string might end in a carriage return (`r) or a carriage return + linefeed (`r`n).
ja: 制御の性質によっては、文字列の最後がキャリッジリターン（`r）またはキャリッジリターン＋ラインフィード（`r`n）になることがあります。

source: Depending on the setting, WinTitle can be an exact title, or it can contain a prefix, a substring which occurs anywhere in the title, or a RegEx pattern.
ja: 設定によって、WinTitleは正確なタイトルになるか、接頭辞、タイトル内の任意の場所に出現する部分文字列、またはRegExパターンを含むことができる。

source: Depending on the specified control type, a string, number or an array.
ja: 指定された制御タイプに応じて、文字列、数値、配列のいずれかを指定します。

source: Depending on which function is called, affected hotkeys and hotstrings are active only while a matching window is active, exists, is not active, or does not exist.
ja: どの関数が呼び出されたかに応じて、影響を受けるホットキーとホットストリングは、一致するウィンドウがアクティブ、存在、アクティブでない、または存在しない間のみアクティブになります。

source: Depending on your username's domain, workgroup, and/or permissions, you may have to connect to a shared device, such as by mapping a drive, prior to attempting remote registry access.
ja: ユーザー名のドメイン、ワークグループ、権限によっては、レジストリへのリモートアクセスに先立ち、ドライブのマッピングなど、共有デバイスへの接続が必要な場合があります。

source: Deprecated:
ja: 非推奨：

source: Descending order.
ja: 降順。

source: Descr
ja: 説明

source: Describes issues relating to DPI scaling.
ja: DPIスケーリングに関する問題を説明する。

source: Description
ja: 説明

source: Designates a multiline edit control.
ja: 複数行編集コントロールを指定する。

source: Destroying the GUI
ja: GUIを破壊する

source: Details
ja: 詳細

source: DetectHiddenText - Syntax & Usage | AutoHotkey v2
ja: DetectHiddenText - 構文と使用法｜AutoHotkey v2

source: DetectHiddenWindows - Syntax & Usage | AutoHotkey v2
ja: DetectHiddenWindows - 構文と使用法｜AutoHotkey v2

source: DetectHiddenWindows True ; Allows a script's hidden main window to be detected.
ja: DetectHiddenWindows True ; スクリプトの隠されたメインウィンドウを検出できるようにします。

source: DetectHiddenWindows True ; Due to fast-mode, this setting will go into effect for the callback too.
ja: DetectHiddenWindows True ; 高速モードのため、この設定はコールバックにも有効になります。

source: Detection is conservative; if a case is ambiguous, it should generally be ignored.
ja: 検出は保守的であり、曖昧なケースは通常無視されるべきである。

source: Detects single, double, and triple-presses of a hotkey.
ja: ホットキーの単押し、二重押し、三重押しを検出します。

source: Detects system shutdown/logoff and allows the user to abort it.
ja: システムのシャットダウン/ログオフを検出し、ユーザーがそれを中止できるようにします。

source: Detects when a key has been double-pressed (similar to double-click).
ja: キーがダブルプレスされたことを検出します（ダブルクリックに似ています）。

source: Determine the order of evaluation.
ja: 評価の順番を決める。

source: Determines the class name of an object.
ja: オブジェクトのクラス名を決定します。

source: Determines the minimum and/or maximum size of the window, such as when the user drags its edges to resize it.
ja: ユーザーがウィンドウの端をドラッグしてサイズを変更するときなど、ウィンドウの最小および最大サイズを決定します。

source: Determines whether a parameter is ByRef.
ja: パラメータがByRefであるかどうかを判定します。

source: Determines whether a parameter is optional.
ja: パラメータがオプションであるかどうかを判定します。

source: Determines whether a script is allowed to run again when it is already running.
ja: スクリプトがすでに実行されているときに、再実行を許可するかどうかを決定します。

source: Determines whether a string contains a pattern (regular expression).
ja: 文字列がパターン（正規表現）を含むかどうかを判定します。

source: Determines whether a window has the WS_DISABLED style.
ja: ウィンドウが WS_DISABLED スタイルを持つかどうかを判定します。

source: Determines whether a window has the WS_EX_TOPMOST style (always-on-top).
ja: ウィンドウのスタイルが WS_EX_TOPMOST（常にトップ）かどうかを判定します。

source: Determines whether invisible text in a window is "seen" for the purpose of finding the window.
ja: ウィンドウ内の不可視テキストが、そのウィンドウを見つけるために「見える」かどうかを判定します。

source: Determines whether invisible windows are "seen" by the script.
ja: 不可視のウィンドウがスクリプトによって「見える」かどうかを決定します。

source: Determines which delimiter was encountered.
ja: どのデリミタに遭遇したかを判定します。

source: Device Manager
ja: デバイス マネージャ

source: Device names typically consist of an endpoint name such as "Speakers" followed by the name of the audio driver in parentheses.
ja: デバイス名は通常、「Speakers」のようなエンドポイント名と、括弧内のオーディオドライバ名で構成される。

source: Device not found
ja: デバイスが見つかりません

source: Devices are listed in the Sound control panel, which can be opened by running mmsys.cpl from the command line, or via the Run dialog (Win+R) or the Run function.
ja: デバイスはサウンドコントロールパネルに一覧表示され、コマンドラインから mmsys.cpl を実行するか、ファイル名を指定して実行ダイアログ（Win+R）または Run 機能で開くことができます。

source: Different Approaches
ja: さまざまなアプローチ

source: Different objects may have different requirements.
ja: 対象が異なれば、要求も異なるだろう。

source: Digital Output (Example HD Audio)
ja: デジタル出力（HDオーディオの例）

source: Dimensions of a 3-D border, in pixels.
ja: 3次元ボーダーの寸法（ピクセル単位）。

source: Dimensions of a grid cell for a minimized window, in pixels.
ja: 最小化されたウィンドウのグリッドセルの寸法（ピクセル単位）。

source: Dimensions of a grid cell for items in large icon view, in pixels.
ja: 大きなアイコン表示のアイテムのグリッドセルの寸法をピクセル単位で指定します。

source: Dimensions of a minimized window, in pixels.
ja: 最小化されたウィンドウの寸法（ピクセル単位）。

source: Dimensions of menu bar buttons, such as the child window close button used in the multiple document interface, in pixels.
ja: 複数ドキュメントのインターフェイスで使われる子ウィンドウを閉じるボタンなどのメニューバーボタンの寸法をピクセル単位で表したもの。

source: Dimensions of small caption buttons, in pixels.
ja: 小さなキャプションボタンの寸法（ピクセル単位）。

source: Dimensions of the default menu check-mark bitmap, in pixels.
ja: デフォルトメニューのチェックマークビットマップの寸法をピクセル単位で示す。

source: DirCopy - Syntax & Usage | AutoHotkey v2
ja: DirCopy - 構文と使用法｜AutoHotkey v2

source: DirCopy copies a single folder.
ja: DirCopyは、1つのフォルダーをコピーします。

source: DirCreate - Syntax & Usage | AutoHotkey v2
ja: DirCreate - 構文と使用法｜AutoHotkey v2

source: DirDelete - Syntax & Usage | AutoHotkey v2
ja: DirDelete - 構文と使用法｜AutoHotkey v2

source: DirExist - Syntax & Usage | AutoHotkey v2
ja: DirExist - 構文と使用法｜AutoHotkey v2

source: DirMove - Syntax & Usage | AutoHotkey v2
ja: DirMove - 構文と使用法｜AutoHotkey v2

source: DirMove moves a single folder to a new location.
ja: DirMoveは、1つのフォルダーを新しい場所に移動します。

source: DirSelect - Syntax & Usage | AutoHotkey v2
ja: DirSelect - 構文と使用法｜AutoHotkey v2

source: Directives that control executable metadata
ja: 実行メタデータを制御するディレクティブ

source: Directives that control the script behaviour
ja: スクリプトの動作を制御するディレクティブ

source: Directories can be "renamed into" another location as long as it's on the same volume.
ja: ディレクトリは、同じボリュームにある限り、別の場所に「リネーム」することができます。

source: Directory that will become Target's current working directory when the shortcut is launched.
ja: ショートカットの起動時にTargetのカレントワーキングディレクトリとなるディレクトリです。

source: Disable UAC completely.
ja: UACを完全に無効化します。

source: Disable or remove any extra software that came with your keyboard or mouse or change its driver to a more standard one such as the one built into the OS.
ja: キーボードやマウスに付属している余分なソフトウェアを無効化または削除するか、OSに内蔵されているような標準的なドライバーに変更してください。

source: Disable the local security policy "Run all administrators in Admin Approval Mode" (not recommended).
ja: ローカルセキュリティポリシー「すべての管理者を管理者承認モードで実行する」（推奨されません）を無効にします。

source: Disable warnings of the given WarningType.
ja: 与えられたWarningTypeの警告を無効化します。

source: Disabled windows are skipped, unless a window it owns (such as a modal dialog) was active more recently than the window itself.
ja: 無効化されたウィンドウは、そのウィンドウが所有するウィンドウ（モーダルダイアログなど）がウィンドウ自身よりも最近アクティブだった場合を除き、スキップされます。

source: Disables MenuItemName if it was previously enabled; otherwise, enables it.
ja: MenuItemNameが以前に有効であった場合、それを無効にし、そうでない場合、それを有効にします。

source: Disables all message boxes and instead outputs errors to the standard error stream (stderr); or to the standard output stream (stdout) if stderr fails.
ja: すべてのメッセージ・ボックスを無効にし、代わりに標準エラー・ストリーム（stderr）にエラーを出力する。stderrが失敗した場合は、標準出力ストリーム（stdout）にエラーを出力する。

source: Disables all warnings.
ja: すべての警告を無効にします。

source: Disables both horizontal and vertical scrolling in the control.
ja: コントロールの水平スクロールと垂直スクロールの両方を無効にする。

source: Disables exemption.
ja: 例外を無効にします。

source: Disables horizontal scrolling in the control.
ja: コントロールの水平スクロールを無効にする。

source: Disables key history entirely.
ja: キーヒストリーを完全に無効にします。

source: Disables or enables all or selected hotkeys and hotstrings.
ja: すべての、または選択したホットキーと ホットストリングを無効または有効にします。

source: Disables or enables the user's ability to interact with the computer via keyboard and mouse.
ja: キーボードとマウスを使ってコンピューターと対話するユーザーの能力を無効または有効にします。

source: Disables the Shift-Win-C hotkey.
ja: Shift-Win-Cのホットキーを無効にします。

source: Disables the hotkey if it is currently enabled.
ja: ホットキーが現在有効になっている場合は、無効にします。

source: Disables the hotstring.
ja: ホットストリングを無効化します。

source: Disables the right Win by having it simply return.
ja: 右Winは単にリターンさせることで無効にする。

source: Disables the showing of a tray icon.
ja: トレイアイコンの表示を無効にします。

source: Disables the window, which prevents the user from interacting with its controls.
ja: ウィンドウを無効化し、ユーザーがそのコントロールと対話することを防ぎます。

source: Disables tooltips.
ja: ツールチップを無効にする。

source: Disadvantages:
ja: デメリット：

source: Display the name of the process which launched the script.
ja: スクリプトを起動したプロセス名を表示します。

source: Displays 5 message boxes, one for each number between 6 and 10.
ja: 6～10までの数字に対して1つずつ、計5つのメッセージボックスを表示します。

source: Displays a checkbox inside the control that users can uncheck to make the control have no date/time selected.
ja: コントロール内にチェックボックスを表示し、ユーザーがそのチェックボックスをオフにすると、コントロールの日付/時刻が選択されなくなります。

source: Displays a checkbox next to each item.
ja: 各項目の横にチェックボックスを表示します。

source: Displays a checkbox with each item.
ja: 各項目にチェックボックスを表示します。

source: Displays a context-sensitive help (via ToolTip) whenever the user moves the mouse over a particular control.
ja: ユーザーが特定のコントロールの上にマウスを移動すると、（ToolTipを介して）コンテキストセンシティブヘルプを表示させます。

source: Displays a masking character in place of each character that is typed into the edit control, which conceals the text.
ja: エディットコントロールに入力された各文字の代わりにマスキング文字を表示し、テキストを隠す。

source: Displays a standard dialog that allows the user to open or save file(s).
ja: ファイルを開く、または保存するための標準的なダイアログを表示します。

source: Displays a standard dialog that allows the user to select a folder.
ja: フォルダを選択するための標準ダイアログを表示します。

source: Displays a summary of all top-level windows.
ja: すべてのトップレベルウィンドウのサマリーを表示します。

source: Displays a tooltip when the mouse hovers over a part of the status bar that:
ja: ステータスバーの上にマウスを置くと、ツールチップを表示する：

source: Displays a tooltip when the mouse hovers over a part of the status bar that: 1) has too much text to be fully displayed; or 2) has an icon but no text.
ja: ステータスバーの上にマウスを置くと、ツールチップを表示する：1) テキストが多すぎて表示しきれない、または 2) アイコンはあるがテキストがない。

source: Displays an error and quits if a version requirement is not met.
ja: バージョン要件を満たさないときにエラーを表示して終了します。

source: Displays an input box to ask the user to enter a string.
ja: 文字列の入力を求める入力ボックスを表示します。

source: Displays gridlines around rows and columns.
ja: 行や列の周囲にグリッド線を表示する。

source: Displays in real time the active window's control list.
ja: アクティブウィンドウのコントロールリストをリアルタイムで表示する。

source: Displays info about each monitor.
ja: 各モニターの情報が表示されます。

source: Displays information about the hotkeys used by the current script.
ja: 現在のスクリプトで使用されているホットキーに関する情報を表示します。

source: Displays information about the script's variables.
ja: スクリプトの変数に関する情報を表示します。

source: Displays only the time, which in some locales looks like 5:31:42 PM.
ja: ロケールによっては午後5時31分42秒のように見える。

source: Displays plus (+) and minus (-) buttons next to parent items.
ja: 親アイテムの横にプラス（＋）とマイナス（-）のボタンを表示する。

source: Displays script info and a history of the most recent keystrokes and mouse clicks.
ja: スクリプト情報、直近のキー操作やマウスクリックの履歴を表示します。

source: Displays the Explorer's properties window for the indicated file.
ja: 表示されているファイルのエクスプローラーのプロパティウィンドウを表示します。

source: Displays the active document in Microsoft Word, if it is running.
ja: Microsoft Wordが起動している場合、アクティブな文書を表示します。

source: Displays the argument as a memory address in hexadecimal digits.
ja: 引数をメモリアドレスとして16進数で表示します。

source: Displays the date in long format.
ja: 日付をロング・フォーマットで表示する。

source: Displays the date in short format with four-digit year.
ja: 日付を4桁の年号を含む短い形式で表示する。

source: Displays the date in short format.
ja: 日付を短いフォーマットで表示する。

source: Displays the drop-down list at all times.
ja: ドロップダウンリストを常に表示する。

source: Displays the history info in a window.
ja: 履歴情報をウィンドウに表示します。

source: Displays the hotkeys in use by the current script, whether their subroutines are currently running, and whether or not they use the keyboard or mouse hook.
ja: 現在のスクリプトで使用中のホットキー、そのサブルーチンが現在実行中かどうか、キーボードまたはマウスフックを使用するかどうかを表示します。

source: Displays the menu, allowing the user to select an item with arrow keys, menu shortcuts (underlined letters), or the mouse.
ja: メニューを表示し、矢印キー、メニューショートカット（下線部文字）、またはマウスで項目を選択できるようにします。

source: Displays the menu.
ja: メニューを表示します。

source: Displays the script's variables:
ja: スクリプトの変数を表示します：

source: Displays the script's variables: their names and current contents.
ja: スクリプトの変数を表示します：その名前と現在の内容です。

source: Displays the specified text in a small window containing one or more buttons (such as Yes and No).
ja: 指定されたテキストを、1つまたは複数のボタン（YesやNoなど）を含む小さなウィンドウに表示します。

source: Displays the window.
ja: ウィンドウを表示します。

source: Displays week numbers (1-52) to the left of each row of days.
ja: 各曜日の左側に週番号（1～52）を表示。

source: Distance to move, in bytes.
ja: 移動する距離（バイト単位）。

source: Divide by zero or other invalid/unsupported input, such as (-1)**1.5.
ja: ゼロで割る、または(-1)**1.5のような無効/非サポートな入力。

source: Division by zero causes a ZeroDivisionError to be thrown.
ja: ゼロによる除算はZeroDivisionErrorをスローする。

source: Division by zero was attempted in an expression or with the Mod function.
ja: 式やMod関数でゼロによる除算を試みた。

source: DllCall - Syntax & Usage | AutoHotkey v2
ja: DllCall - 構文と使用法｜AutoHotkey v2

source: DllCall automatically uses the address of the buffer, which is normally retrieved by using MyStruct.Ptr.
ja: DllCallは自動的にバッファのアドレスを使用しますが、これは通常MyStruct.Ptrを使用して取得されます。

source: DllCall now accepts an object for any Ptr parameter and the Function parameter; the object must have a Ptr property.
ja: DllCallは、PtrパラメータとFunctionパラメータにオブジェクトを受け付けるようになりました（オブジェクトはPtrプロパティを持つ必要があります）。

source: DllCall now requires the values of numeric-type parameters to be numeric, and will throw an exception if given a non-numeric or empty string.
ja: DllCallでは、数値型パラメータの値が数値であることが要求されるようになり、数値以外または空文字列が与えられた場合は例外がスローされます。

source: DllCall returns the actual value returned by Function.
ja: DllCallは、Functionが返す実際の値を返します。

source: DllCall throws an Error under any of the following conditions:
ja: DllCallは、以下のいずれかの条件下でErrorを投げる：

source: DllCall tries the A or W suffix in more cases
ja: DllCallは、より多くのケースでAまたはWのサフィックスを試します

source: DllCall("Function", "ptr", buf) ; Pass buffer to function.
ja: DllCall("Function", "ptr", buf) ; バッファを関数に渡す。

source: DllCall("FreeLibrary", "Ptr", hModule) ; To conserve memory, the DLL may be unloaded after using it.
ja: DllCall("FreeLibrary", "Ptr", hModule) ; メモリ節約のため、使用後はDLLをアンロードすることがあります。

source: DllCall("CloseHandle", "Ptr", hFile) ; Close the file.
ja: DllCall("CloseHandle", "Ptr", hFile) ; ファイルを閉じる。

source: DllCall("DeleteObject", "Ptr", hBrush) ; Clean-up.
ja: DllCall("DeleteObject", "Ptr", hBrush) ; クリーンアップ。

source: DllCall("FillRect", "Ptr", hDC, "Ptr", Rect, "Ptr", hBrush) ; Fill the specified rectangle using the brush above.
ja: DllCall("FillRect", "Ptr", hDC, "Ptr", Rect, "Ptr", hBrush) ; 指定された矩形を上記のブラシで塗りつぶす。

source: DllCall("GetWindowRect", "Ptr", WinExist(), "Ptr", Rect) ; WinExist returns an HWND.
ja: DllCall("GetWindowRect", "Ptr", WinExist(), "Ptr", Rect) ; WinExistはHWNDを返す。

source: DllCall("ReleaseDC", "Ptr", 0, "Ptr", hDC) ; Clean-up.
ja: DllCall("ReleaseDC", "Ptr", 0, "Ptr", hDC) ; クリーンアップ。

source: DllCall("SystemParametersInfo", "UInt", SPI_SETMOUSESPEED, "UInt", 0, "Ptr", OrigMouseSpeed, "UInt", 0) ; Restore the original speed.
ja: DllCall("SystemParametersInfo", "UInt", SPI_SETMOUSESPEED, "UInt", 0, "Ptr", OrigMouseSpeed, "UInt", 0) ; 元の速度に戻す。

source: DllCall("wsprintf", "Ptr", ZeroPaddedNumber, "Str", "%010d", "Int", 432, "Cdecl") ; Requires the Cdecl calling convention.
ja: DllCall("wsprintf", "Ptr", ZeroPaddedNumber, "Str", "%010d", "Int", 432, "Cdecl") ; Cdecl の呼び出し規約を必要とします。

source: Dn and Tn may be repeated to put more than one option into effect, such as this example:
ja: DnとTnは、この例のように、複数の選択肢を有効にするために繰り返すことができる：

source: Do not remove files and sub-directories contained in DirName.
ja: DirNameに含まれるファイルやサブディレクトリを削除しない。

source: Do not conform to typed case.
ja: 型番の大文字と小文字を一致させない。

source: Do not enclose the name in double quotes even if it contains spaces.
ja: 空白を含む場合でも、ダブルクォーテーションで囲まないでください。

source: Do not overwrite existing files.
ja: 既存のファイルを上書きしないでください。

source: Do not play the notification sound.
ja: 通知音を鳴らさない。

source: Do not specify any value for Mask other than 0 or 1; all other bits are reserved for future use.
ja: Maskには0または1以外の値を指定しないでください。他のすべてのビットは将来の使用のために予約されています。

source: Do this prior to cancel/destroy so that the owner will be reactivated automatically.
ja: オーナーが自動的に再活性化されるように、キャンセル/破棄の前にこの操作を行います。

source: DoOverwrite := 2 ; See DirMove for description of mode 2 vs. 1.
ja: DoOverwrite := 2 ; モード 2 とモード 1 の比較については、DirMoveを参照してください。

source: Documentation.
ja: ドキュメンテーション.

source: Does it really contain a virus?
ja: 本当にウイルスが含まれているのでしょうか？

source: Does not insert a thousands separator between every three decimal digits in the buddy control.
ja: バディ・コントロールの小数点以下3桁の間に桁区切り記号を挿入しない。

source: Does nothing.
ja: 何もしない。

source: Doing so may cause some items to be skipped or enumerated multiple times.
ja: そのため、一部の項目がスキップされたり、複数回列挙されたりすることがあります。

source: Dollar-sign ($) matches before any newlines in Haystack (as well as at the very end where it always matches).
ja: ドル記号（$）は、Haystackの改行の前にマッチします（常にマッチする末尾にもマッチします）。

source: Don't be afraid to ask for help, even the smartest people ask others for help.
ja: 助けを求めることを恐れてはいけない。どんなに賢い人でも、他人に助けを求めるものだ。

source: Don't be afraid to show what you tried, even if you think it's silly.
ja: たとえバカバカしいと思っても、トライしたことを見せることを恐れてはいけない。

source: Don't be limited to using only Ctrl, Alt, Shift, and Win as modifiers; you can combine any two keys or mouse buttons to form a custom hotkey.
ja: Ctrl、Alt、Shift、Winの4つのキーだけでなく、2つのキーやマウスのボタンを組み合わせて、カスタムホットキーを作成することができます。

source: Dot notation
ja: ドット表記

source: Double-click a script file (or shortcut to a script file) in Explorer.
ja: エクスプローラでスクリプトファイル（またはスクリプトファイルへのショートカット）をダブルクリックします。

source: Double-click that script's tray icon to open its main window.
ja: そのスクリプトのトレイアイコンをダブルクリックして、メインウィンドウを開きます。

source: Double-click the file/icon in the desktop to run it.
ja: デスクトップにあるファイル／アイコンをダブルクリックして実行します。

source: Double-clicking empty space below the last item usually focuses the last item and leaves the selection as it was.
ja: 最後の項目の下の空白をダブルクリックすると、通常、最後の項目がフォーカスされ、選択範囲がそのままになります。

source: Double-clicks at the current mouse position.
ja: 現在のマウス位置でダブルクリックする。

source: Double-deref syntax is now also used to dereference VarRefs, such as ref := &var, value := %ref%.
ja: ref := &var, value := %ref%のように、VarRefの再参照にもダブルデリフ構文が使われるようになりました。

source: Double-derefs now permit almost any expression (not just variables) as the source of the variable name.
ja: ダブルデフでは、変数名のソースとして（変数に限らず）ほぼすべての式が使用できるようになりました。

source: Double-derefs which fail for any reason now cause an error to be thrown.
ja: ダブルデフが何らかの理由で失敗した場合、エラーが発生するようになりました。

source: Doubling the quote marks has no special meaning, and causes an error since auto-concat requires a space.
ja: 引用符を二重にしても特別な意味はなく、auto-concatではスペースが必要なのでエラーになる。

source: Download "ftp://example.com/home/My File.zip", "C:\My Folder\My File.zip" ; Log in anonymously.
ja: Download "ftp://example.com/home/My File.zip", "C:\My Folder\My File.zip" ; 匿名でログインします。

source: Download "ftp://user:pass@example.com/My Directory", "C:\Dir Listing.html" ; Gets a directory listing in HTML format.
ja: Download "ftp://user:pass@example.com/My Directory", "C:\Dir Listing.html" ; HTML形式のディレクトリ一覧を取得します。

source: Download "ftp://user:pass@example.com:21/home/My File.zip", "C:\My Folder\My File.zip" ; Log in as a specific user.
ja: Download "ftp://user:pass@example.com:21/home/My File.zip", "C:\My Folder\My File.zip" ; 特定のユーザーでログインしてください。

source: Download - Syntax & Usage | AutoHotkey v2
ja: Download - 構文と使用法｜AutoHotkey v2

source: Download:
ja: ダウンロード：

source: Download: AutoCorrect.ahk (127 KB)
ja: ダウンロード：AutoCorrect.ahk（127 KB）

source: Downloading and installing AutoHotkey
ja: AutoHotkeyのダウンロードとインストール

source: Downloads
ja: ダウンロード

source: Downloads a file from the Internet.
ja: インターネットからファイルをダウンロードします。

source: Downloads a text file.
ja: テキストファイルをダウンロードします。

source: Downloads a zip file.
ja: ZIPファイルをダウンロードします。
